/******************************************************************************
  * 文件名程: main.c 
  * 作    者: 硬石嵌入式开发团队
  * 版    本: V1.0
  * 编写日期: 2015-10-04
  * 功    能: 标准库函数编程工程模板
  ******************************************************************************
  * 说明：
  * 本例程配套硬石stm32开发板YS-F1Pro使用。
  * 
  * 淘宝：
  * 论坛：http://www.ing10bbs.com
  * 版权归硬石嵌入式开发团队所有，请勿商用。
  ******************************************************************************
  */

/* 包含头文件 ----------------------------------------------------------------*//* Includes ------------------------------------------------------------------*/
#include "stm32f10x.h"


/* 私有类型定义 --------------------------------------------------------------*/
/* 私有宏定义 ----------------------------------------------------------------*/
/* 私有变量 ------------------------------------------------------------------*/
/* 扩展变量 ------------------------------------------------------------------*/
/* 私有函数原形 --------------------------------------------------------------*/
/* 函数体 --------------------------------------------------------------------*/

/**
  * 函数功能: 主函数.
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 无
  */
  int mainProc(void);
  void BSP_Init(void);
int main(void)
{
//  GPIO_InitTypeDef GPIO_InitStructure;
//	
//	/* 使能GPIOG时钟  */
//  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);

//  /* 配置PG6 and PG7为推挽输出模式  */
//  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9;
//  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
//  GPIO_Init(GPIOC, &GPIO_InitStructure);
	
//	BSP_Init();
 // GPIO_SetBits(GPIOC,GPIO_Pin_6 | GPIO_Pin_7 | GPIO_Pin_8 | GPIO_Pin_9);
  
	
	
	mainProc();
  while (1)
  {
	  
  }
}


#ifdef  USE_FULL_ASSERT

/**
  * 函数功能: 报告名称的源文件和源代码行数，assert_param错误已经发生。
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明：
  *           
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* 用户可以添加自己的执行情况来报告文件名和行数,
     例子: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* 无限循环 */
  while (1)
  {
  }
}
#endif

/**
  * @}
  */

/******************* (C) COPYRIGHT 2015-2020 硬石嵌入式开发团队 *****END OF FILE****/
